VV_cases/V1_solver/templates/base_case/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         30;              // 30 s >> T_shed ~ 0.5 s  (60 cycles)

deltaT          5e-4;
adjustTimeStep  no;              // fixed dt for V&V reproducibility
maxCo           0.8;             // monitor only

writeControl    runTime;
writeInterval   0.5;             // 2 writes/cycle initially; reduce for production

purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   8;
runTimeModifiable true;

functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            (forces);
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
        log             yes;

        patches         (cylinder);
        rho             rhoInf;
        rhoInf          1.205;          // kg/m^3  air @ 20 C
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         0.1263;         // Re=100 inlet velocity
        lRef            0.012;          // D
        Aref            0.000120;       // D * span = 0.012 * 0.010 (z-span 10 mm)
    }

    residuals
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (U p);
        writeControl    timeStep;
        writeInterval   1;
    }

    CourantNo
    {
        type            CourantNo;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }
}
