VV_cases/V1_solver/templates/base_case/constant/turbulenceProperties
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }
simulationType  laminar;
