VV_cases/V1_solver/templates/base_case/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;
nu              1.516e-5;           // m^2/s  kinematic viscosity air @ 20 C
