VV_cases/V1_solver/templates/base_case/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// V1: pimpleFoam incompressible — kinematic pressure p/rho [m^2/s^2]

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet
    {
        type        zeroGradient;
    }
    outlet
    {
        type        fixedValue;
        value       uniform 0;
    }
    top
    {
        type        zeroGradient;
    }
    bottom
    {
        type        zeroGradient;
    }
    cylinder
    {
        type        zeroGradient;
    }
    front
    {
        type        empty;
    }
    back
    {
        type        empty;
    }
}
